2024-03-12-AcademicCitationsandAPA/notes.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://dou-meishi.github.io/org-blog/rss.xml"
      title="RSS feed for https://dou-meishi.github.io/org-blog/">
<title>Academic Citations and APA Style</title>
<meta name="author" content="Dou Meishi">
<meta name="referrer" content="no-referrer">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link href= "https://gongzhitaao.org/orgcss/org.css" rel="stylesheet" type="text/css" />
<link href= "https://dou-meishi.github.io/org-blog/static/dou-org-blog.css" rel="stylesheet" type="text/css" />
<!-- Math Support by KaTeX -->
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/katex@0.16.9/dist/katex.min.css" integrity="sha384-n8MVd4RsNIU0tAv4ct0nTaAbDJwPJzDEaqSD1odI+WdtXRGWt2kTvGFasHpSy3SV" crossorigin="anonymous">
<!-- The loading of KaTeX is deferred to speed up page rendering -->
<!-- To automatically render math in text elements, include the auto-render extension: -->
</head>
<body>
<div id="preamble" class="status"><div class="header">
  <div class="sitelinks">
    <a href="https://dou-meishi.github.io/org-blog/index.html">Home</a>
    |
    <a href="https://dou-meishi.github.io/org-blog/archive.html">All Posts</a>
  </div>
</div>
</div>
<div id="content">
<div class="post-date">12 Mar 2024</div><h1 class="post-title"><a href="https://dou-meishi.github.io/org-blog/2024-03-12-AcademicCitationsandAPA/notes.html">Academic Citations and APA Style</a></h1>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1b03428">In-text Citations and The Reference List</a></li>
<li><a href="#org6835d53">Formatting Rules for In-text Citations</a></li>
<li><a href="#org41c592d">Formatting Rules for Reference List Entries</a>
<ul>
<li><a href="#org43a8802">The Author Element</a></li>
<li><a href="#orgc603a83">The Date Element</a></li>
<li><a href="#org10a1f72">The Title Element</a></li>
<li><a href="#org5472db5">The Source Element</a></li>
<li><a href="#orgf3256a1">Examples</a></li>
</ul>
</li>
<li><a href="#orgbaa162f">The Official APA Website</a></li>
<li><a href="#org88572ca">A File Naming Convention for References</a></li>
<li><a href="#org63fb7bd">References&#xa0;&#xa0;&#xa0;<span class="tag"><span class="refs">refs</span></span></a></li>
</ul>
</div>
</nav>
<p>
Citations are important in academic writings, not only for
acknowledging the original authors and avoiding plagiarism, but also
for <i>effective communication</i>. Citations help readers track the
evolution of thought and provide the source where they can retrieve
the original material. Citations can also add strength and authority
to your work. In this post, I will show how to properly cite sources
in academic writings. In particular, I will follow the APA (American
Psychological Association) citation style.
</p>

<p>
You may ask why bother to understand these conceps? There are a plenty of
reference manager software available to help generate nicely formatted
citations in various styles, e.g., Zotero (I use it too), EndNote,
Mendeley, and even google scholar. However, they are only tools and do
not tell us what kind of citation is needed in different
situations. Moreover, it is beneficial to have a brief understanding
of how the citation is formatted so that we can format simple
citations by ourself (it is achievable in APA style), and even
implement a function that suits our need using a programming language.
</p>

<p>
I will begin by discussing the concepts of in-text citation and the
reference list, followed by demonstrations through
examples. Naturally, it is impossible to cover all formatting rules in
a brief post. Therefore, I will direct you to <a href="https://apastyle.apa.org/">the APA style official
website</a> and illustrate how to locate resources there. Finally, I
will introduce my file naming convention for references by following
APA style.
</p>

<div id="outline-container-org1b03428" class="outline-2">
<h2 id="org1b03428">In-text Citations and The Reference List</h2>
<div class="outline-text-2" id="text-org1b03428">
<p>
In APA style, the reference metadata are typically grouped into four
elements:
</p>

<ul class="org-ul">
<li><i>author</i>, i.e., their names;</li>
<li><i>date</i>, in most cases., the publication year;</li>
<li><i>title</i>, i.e., the title of the cited work;</li>
<li>and <i>source</i>, which specifies where to retrieve the cited work.</li>
</ul>

<p>
<i>In-text citation</i> appears within the body of the paper and contain
only <i>author</i> and <i>date</i> of publication, directing readers to locate the
corresponding entry in the <i>reference list</i> at the end of the paper,
which contains additional information include <i>title</i> and <i>source</i>.
</p>
</div>
</div>

<div id="outline-container-org6835d53" class="outline-2">
<h2 id="org6835d53">Formatting Rules for In-text Citations</h2>
<div class="outline-text-2" id="text-org6835d53">
<p>
There are two type of in-text citations:
</p>

<ul class="org-ul">
<li><p>
<i>parenthetical citations</i>, where the author's surname and year appear
in parentheses.  This often appears at the end of a sentence, e.g.,
</p>

<pre class="example" id="org96ea971">
Falsely balanced news coverage can distort the public’s perception
of expert consensus on an issue (Koehler, 2016).

It was found that ... (Anderson &amp; Bratos-Anderson, 1987).

It was found that ... (Reynar et al., 2010).
</pre></li>

<li><p>
<i>narrative citations</i>, where the author's surname appears as part of
the sentence, followed by the year in parentheses. In this case, <code>&amp;</code>
is replaced by the word <code>and</code>. For three or more authors, use <code>et. al</code>.,
This often appears at the beginning of a sentence, e.g.,
</p>

<pre class="example" id="orgc2c321c">
Koehler (2016) noted the dangers of falsely balanced news coverage.

Anderson and Bratos-Anderson (1987) found that ...

Reynar et al. (2010) found that ...
</pre></li>
</ul>
</div>
</div>

<div id="outline-container-org41c592d" class="outline-2">
<h2 id="org41c592d">Formatting Rules for Reference List Entries</h2>
<div class="outline-text-2" id="text-org41c592d">
<p>
While in-text citation doesn’t vary depending on source type,
reference list citations are highly variable depending on the source.
As mentioned before, a reference entry includes the four elements of
the author, date, title, and source; see <a href="https://apastyle.apa.org/style-grammar-guidelines/references/elements-list-entry">Elements of Reference List
Entries</a> for more details.
</p>
</div>

<div id="outline-container-org43a8802" class="outline-3">
<h3 id="org43a8802">The Author Element</h3>
<div class="outline-text-3" id="text-org43a8802">
<p>
<i>Author</i> refers broadly to the person(s) or group(s) responsible for a
work. An author may be an individual, multiple people, or a group
(institution, government agency, organization, etc.). When formatting,
provide the surname first, followed by a comma and the author’s
initials. Use a comma to separate different authors. Use <code>&amp;</code> before the
final author’s name. When there are too many, say 21 or more authors,
include the first 19 authors’ names, insert an ellipsis (but no
ampersand), and then add the final author’s name.
</p>

<pre class="example" id="orgbbf2f57">
Author, A. A.

Author, A. A., &amp; Author, B. B.

Author, A. A., Author, B. B., &amp; Author, C. C.

Author, A. A., Author, B. B., Author, C. C., Author, D. D., Author, E. E.,
        Author, F. F., Author, G. G., Author, H. H., Author, I. I.,
        Author, J. J., Author, K. K., Author, L. L., Author, M. M.,
        Author, N. N., Author, O. O., Author, P. P., Author, Q. Q.,
        Author, R. R., Author, S. S., . . . Author, Z. Z.
</pre>
</div>
</div>

<div id="outline-container-orgc603a83" class="outline-3">
<h3 id="orgc603a83">The Date Element</h3>
<div class="outline-text-3" id="text-orgc603a83">
<p>
<i>Date</i> refers to the date of publication of the work. It can be year
only or an exact date. When formatting, enclose the date in
parentheses, followed by a period.
</p>

<pre class="example" id="org9650d36">
(2020).

(2018, July).

(2020, August 26).
</pre>
</div>
</div>

<div id="outline-container-org10a1f72" class="outline-3">
<h3 id="org10a1f72">The Title Element</h3>
<div class="outline-text-3" id="text-org10a1f72">
<p>
<i>Title</i> refers to the title of the work being cited. When formatting,
capitalize the title using sentence case and finish the title with a
period<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>. Italicize the title for stand alone works (e.g., books
and webpages). But do not italicize for works that a part of a great
whole (e.g., journal articles and conference papers).
</p>

<pre class="example" id="orga51018b">
Happy fish in little ponds: Testing a reference group model of achievement and emotion.
</pre>
</div>
</div>

<div id="outline-container-org5472db5" class="outline-3">
<h3 id="org5472db5">The Source Element</h3>
<div class="outline-text-3" id="text-org5472db5">
<p>
<i>Source</i> indicates where readers can retrieve the cited work. As with
titles, sources fall into two broad categories: works that are part of
a greater whole and works that stand alone:
</p>

<ul class="org-ul">
<li>for books, the source is the publisher;</li>
<li>for webpages, the source is the website;</li>
<li>for journal articles, the source is the journal;</li>
<li>for conference papers, the source is the conference.</li>
</ul>

<p>
The format of the source varies depending on the reference type.
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Reference type</th>
<th scope="col" class="org-left">Component of the source</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Journal article</td>
<td class="org-left">Italic journal title, volume(issue), pages.</td>
<td class="org-left"><i>Couple and Family Psychology: Research and Practice</i>, 8(3), 137–151.</td>
</tr>

<tr>
<td class="org-left">Book</td>
<td class="org-left">Publisher name</td>
<td class="org-left">Springer.</td>
</tr>

<tr>
<td class="org-left">Webpage on a website</td>
<td class="org-left">Website name</td>
<td class="org-left">Mayo Clinic.</td>
</tr>

<tr>
<td class="org-left">webpage on a website (when authors are the same as the site name)</td>
<td class="org-left">URL</td>
<td class="org-left"><a href="https://www.cdc.gov/cancer/kinds.htm">https://www.cdc.gov/cancer/kinds.htm</a></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgf3256a1" class="outline-3">
<h3 id="orgf3256a1">Examples</h3>
<div class="outline-text-3" id="text-orgf3256a1">
<p>
A conference paper:
</p>

<p>
Song, Y., Sohl-Dickstein, J., Kingma, D. P., Kumar, A., Ermon, S., &amp;
Poole, B. (2021). Score-Based Generative Modeling through Stochastic
Differential Equations. <i>International Conference on Learning
Representations</i>.
</p>

<p>
A book:
</p>

<p>
Bertsekas, D., Nedic, A., &amp; Ozdaglar, A. (2003). <i>Convex Analysis and Optimization</i>. Athena Scientific.
</p>

<p>
A webpage:
</p>

<p>
Dohmatob, E. (2021). <i>Fenchel-Rockafellar duality theorem, one ring to rule’em all! - Part 1</i>. <a href="https://dohmatob.github.io/research/2019/10/31/duality.html">https://dohmatob.github.io/research/2019/10/31/duality.html</a>
</p>

<p>
For more examples, see the <a href="https://apastyle.apa.org/style-grammar-guidelines/references/examples">Reference Examples</a> page of APA website.
</p>
</div>
</div>
</div>

<div id="outline-container-orgbaa162f" class="outline-2">
<h2 id="orgbaa162f">The Official APA Website</h2>
<div class="outline-text-2" id="text-orgbaa162f">
<p>
<a href="https://apastyle.apa.org/">The APA style official website</a> contains a comprehensive section of
<a href="https://apastyle.apa.org/style-grammar-guidelines">Style and Grammar Guidelines</a>, an illustrative section of <a href="https://apastyle.apa.org/instructional-aids/handouts-guides">Handouts and
Guides</a>, and a blog section of <a href="https://apastyle.apa.org/blog">Posts</a>. I recommend reading the post
<a href="https://apastyle.apa.org/beginners">APA Style for beginners</a>, in particular, the 2 minutes demonstrating
video introducing the APA style website. The <a href="https://extras.apa.org/apastyle/basics-7e/#/">Academic Writer Tutorial</a>
is also highly recommended. The following cheat sheets are also
useful:
</p>

<ol class="org-ol">
<li><a href="https://apastyle.apa.org/instructional-aids/beginner-student-paper-checklist.pdf">Student Paper Checklist</a>,</li>
<li><a href="https://apastyle.apa.org/instructional-aids/reference-examples.pdf">Common Reference Examples Guide</a>.</li>
</ol>
</div>
</div>

<div id="outline-container-org88572ca" class="outline-2">
<h2 id="org88572ca">A File Naming Convention for References</h2>
<div class="outline-text-2" id="text-org88572ca">
<p>
I always try to follow some file naming convention for electronic
documents. After knowing APA style, I realize that it offers a perfect
structure for naming references. In particular, I create two folders,
<code>~/Books/</code> and <code>~/Papers/</code>, to store my references. Each local copy is
named according to a simple version of the format used in the
reference list:
</p>

<ul class="org-ul">
<li>it does not contain the <i>source</i> element;</li>
<li>a maximum of three authors are represented;</li>
<li>the date element is confined to the year only;</li>
<li>the title element may be shortened.</li>
</ul>

<p>
Here are some examples:
</p>

<pre class="example" id="orgfb3636e">
Anderson, B. D. O. (1982). Reverse-time diffusion equation models.pdf

Polyanskiy, Y., &amp; Wu, Y. (2022). Information theory.pdf

Ho, J., Jain, A., &amp; Abbeel, P. (2020). DDPM.pdf

Goodfellow, I., Pouget-Abadie, J., ... Bengio, Y. (2014). GAN.pdf
</pre>
</div>
</div>

<div id="outline-container-org63fb7bd" class="outline-2">
<h2 id="org63fb7bd">References&#xa0;&#xa0;&#xa0;<span class="tag"><span class="refs">refs</span></span></h2>
<div class="outline-text-2" id="text-org63fb7bd">
<ul class="org-ul">
<li>APA Org (2020). <i>Academic Writer Tutorial: Basics of Seventh Edition APA Style</i>. <a href="https://extras.apa.org/apastyle/basics-7e/#/">https://extras.apa.org/apastyle/basics-7e/#/</a></li>
<li>APA Org (2024). <i>Style and Grammar Guidelines</i>. <a href="https://apastyle.apa.org/style-grammar-guidelines">https://apastyle.apa.org/style-grammar-guidelines</a></li>
<li>Mendeley (2024). <i>APA Format Citation Guide</i>. <a href="https://www.mendeley.com/guides/apa-citation-guide/">https://www.mendeley.com/guides/apa-citation-guide/</a></li>
</ul>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
However, if the title ends with a question mark or exclamation
point, that punctuation mark replaces the period.
</p></div></div>


</div>
</div><div class="taglist"><a href="https://dou-meishi.github.io/org-blog/tags.html">Tags</a>: <a href="https://dou-meishi.github.io/org-blog/tag-tool.html">tool</a> </div></div>
<div id="postamble" class="status">Created by <a href="https://github.com/bastibe/org-static-blog/">Org Static Blog</a>
</div>
</body>
</html>
